output/anita.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.anita.com (be patient)


Server Software:        Apache
Server Hostname:        www.anita.com
Server Port:            80

Document Path:          /de_global/
Document Length:        34047 bytes

Concurrency Level:      100
Time taken for tests:   21.131 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      17125000 bytes
HTML transferred:       17023500 bytes
Requests per second:    23.66 [#/sec] (mean)
Time per request:       4226.252 [ms] (mean)
Time per request:       42.263 [ms] (mean, across all concurrent requests)
Transfer rate:          791.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       20  202 416.2     32    2390
Processing:   373 2565 2062.0   1834   18686
Waiting:      309 2067 1582.0   1490   14651
Total:        437 2767 2145.9   2045   18709

Percentage of the requests served within a certain time (ms)
  50%   2045
  66%   3077
  75%   3726
  80%   4123
  90%   5422
  95%   6723
  98%   8038
  99%  11403
 100%  18709 (longest request)