output/anita.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.anita.com (be patient).....done


Server Software:        Apache
Server Hostname:        www.anita.com
Server Port:            80

Document Path:          /de_global/
Document Length:        34047 bytes

Concurrency Level:      100
Time taken for tests:   6.444 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      3425000 bytes
HTML transferred:       3404700 bytes
Requests per second:    15.52 [#/sec] (mean)
Time per request:       6443.774 [ms] (mean)
Time per request:       64.438 [ms] (mean, across all concurrent requests)
Transfer rate:          519.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       79  112  49.0    108     416
Processing:   452 1743 1167.1   1513    6335
Waiting:      391 1472 710.9   1421    2999
Total:        577 1855 1165.4   1639    6442

Percentage of the requests served within a certain time (ms)
  50%   1639
  66%   2234
  75%   2344
  80%   2439
  90%   2918
  95%   5206
  98%   6434
  99%   6442
 100%   6442 (longest request)