output/anita.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.anita.com (be patient)


Server Software:        Apache
Server Hostname:        www.anita.com
Server Port:            80

Document Path:          /de_global/
Document Length:        34047 bytes

Concurrency Level:      100
Time taken for tests:   14.601 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      17125000 bytes
HTML transferred:       17023500 bytes
Requests per second:    34.25 [#/sec] (mean)
Time per request:       2920.115 [ms] (mean)
Time per request:       29.201 [ms] (mean, across all concurrent requests)
Transfer rate:          1145.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21  156 372.6     30    2343
Processing:   306 2237 2318.1   1498   12974
Waiting:      262 2144 2305.2   1423   12743
Total:        348 2394 2487.3   1578   14599

Percentage of the requests served within a certain time (ms)
  50%   1578
  66%   2571
  75%   3329
  80%   3788
  90%   5602
  95%   6869
  98%  11373
  99%  13122
 100%  14599 (longest request)