output/apolife.de.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.apolife.de (be patient)


Server Software:        Apache
Server Hostname:        www.apolife.de
Server Port:            80

Document Path:          /
Document Length:        47822 bytes

Concurrency Level:      100
Time taken for tests:   20.374 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      24060455 bytes
HTML transferred:       23911000 bytes
Requests per second:    24.54 [#/sec] (mean)
Time per request:       4074.757 [ms] (mean)
Time per request:       40.748 [ms] (mean, across all concurrent requests)
Transfer rate:          1153.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       39  810 2230.6     49   12424
Processing:   409 2972 787.1   3031    4782
Waiting:      315 2844 790.7   2894    4684
Total:        453 3782 2453.4   3259   16712

Percentage of the requests served within a certain time (ms)
  50%   3259
  66%   3614
  75%   3852
  80%   4063
  90%   5385
  95%   9180
  98%  15281
  99%  15975
 100%  16712 (longest request)