output/bc-smartsystems.nl.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.bc-smartsystems.nl (be patient)


Server Software:        nginx/1.4.6
Server Hostname:        www.bc-smartsystems.nl
Server Port:            80

Document Path:          /
Document Length:        9840 bytes

Concurrency Level:      100
Time taken for tests:   34.210 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      5054674 bytes
HTML transferred:       4920000 bytes
Requests per second:    14.62 [#/sec] (mean)
Time per request:       6841.962 [ms] (mean)
Time per request:       68.420 [ms] (mean, across all concurrent requests)
Transfer rate:          144.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       23  162 353.7     32    2357
Processing:    26 3453 8137.0     33   34097
Waiting:       24 3432 8103.5     32   34067
Total:         53 3616 8176.6     65   34207

Percentage of the requests served within a certain time (ms)
  50%     65
  66%     71
  75%   1184
  80%   2362
  90%  17363
  95%  26080
  98%  31308
  99%  33103
 100%  34207 (longest request)