output/buchung.bvb-fa.de.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking buchung.bvb-fa.de (be patient)


Server Software:        Apache/2.4.12
Server Hostname:        buchung.bvb-fa.de
Server Port:            80

Document Path:          /
Document Length:        6973 bytes

Concurrency Level:      100
Time taken for tests:   35.326 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      3636500 bytes
HTML transferred:       3486500 bytes
Requests per second:    14.15 [#/sec] (mean)
Time per request:       7065.167 [ms] (mean)
Time per request:       70.652 [ms] (mean, across all concurrent requests)
Transfer rate:          100.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       25   88 185.4     32    1081
Processing:  5134 6508 2438.4   5402   13777
Waiting:      136 1500 2434.6    396    8778
Total:       5164 6596 2519.3   5488   14223

Percentage of the requests served within a certain time (ms)
  50%   5488
  66%   5641
  75%   5879
  80%   7291
  90%  12050
  95%  12860
  98%  13745
  99%  13864
 100%  14223 (longest request)