output/centurion-magazine.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.centurion-magazine.com (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        www.centurion-magazine.com
Server Port:            80

Document Path:          /home.html
Document Length:        51353 bytes

Concurrency Level:      100
Time taken for tests:   21.403 seconds
Complete requests:      500
Failed requests:        22
   (Connect: 0, Receive: 0, Length: 22, Exceptions: 0)
Non-2xx responses:      17
Total transferred:      24813901 bytes
HTML transferred:       24553840 bytes
Requests per second:    23.36 [#/sec] (mean)
Time per request:       4280.633 [ms] (mean)
Time per request:       42.806 [ms] (mean, across all concurrent requests)
Transfer rate:          1132.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       23   84 190.0     31    1429
Processing:    23 3771 1158.0   4011    7038
Waiting:        0 3608 1173.4   3894    6580
Total:         48 3854 1171.5   4044    8466

Percentage of the requests served within a certain time (ms)
  50%   4044
  66%   4132
  75%   4188
  80%   4220
  90%   4400
  95%   5829
  98%   6746
  99%   6865
 100%   8466 (longest request)