output/centurion-magazine.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.centurion-magazine.com (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        www.centurion-magazine.com
Server Port:            80

Document Path:          /home.html
Document Length:        51353 bytes

Concurrency Level:      100
Time taken for tests:   20.568 seconds
Complete requests:      500
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      10
Total transferred:      25431430 bytes
HTML transferred:       25167150 bytes
Requests per second:    24.31 [#/sec] (mean)
Time per request:       4113.523 [ms] (mean)
Time per request:       41.135 [ms] (mean, across all concurrent requests)
Transfer rate:          1207.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21   58  69.2     29     455
Processing:    22 3678 1046.4   3998    6561
Waiting:       22 3593 1033.5   3911    6253
Total:         48 3736 1031.1   4029    6899

Percentage of the requests served within a certain time (ms)
  50%   4029
  66%   4098
  75%   4125
  80%   4151
  90%   4233
  95%   4418
  98%   5186
  99%   6652
 100%   6899 (longest request)